In [ ]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("original data:\n")
df=pd.read_excel("/content/Marks.xlsx")
print(df)

original data:

    S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      105      arun  87.0  89.0   90.0     94.0    99.0  459.0
1      2      106     rashi  98.0  75.0   90.0     89.0    78.0  430.0
2      3      107    magizh  99.0  98.0   97.0    100.0    90.0  484.0
3      4      108    chitra  80.0  88.0   98.0     96.0    94.0  456.0
4      5      109    tharun  78.0  79.0   90.0     80.0    79.0  406.0
5      6      110     varun  90.0  91.0   92.0     93.0    94.0  460.0
6      7      111       NaN   NaN   NaN    NaN      NaN     NaN    NaN
7      8      112    monish  89.0  80.0   87.0     88.0    86.0  430.0
8      9      113    thanvi  78.0  87.0   97.0     90.0    89.0  441.0
9     10      114    swetha  88.0  80.0   89.0     90.0    94.0  441.0
10    11      115      rani  99.0  90.0   83.0     85.0    67.0  424.0
11    12      116     kumar  67.0  60.0   55.0     76.0    57.0  315.0
12    13      117   santosh  99.0  90.0   98.0     97.0    96.0  480.0
13    14      118     maddy  86.0  89.0   90.0     76.0    89.0  430.0
14    15      119  thrishal  99.0  96.0   95.0     86.0    87.0  463.0
15    16      120      moni  90.0  88.0   90.0     89.0    90.0  447.0
16    17      121     priya  99.0  90.0   95.0     85.0    91.0  460.0
17    18      122    sherin  97.0  98.0   94.0     94.0    90.0  473.0
18    19      123    kaviya  95.0  87.0   95.0     96.0    98.0  471.0
19    20      124      viji  94.0  88.0   56.0     99.0    99.0  436.0

In [ ]:
f=df["NAME"].str.strip()
f.to_excel("/content/Marks2.xlsx")
print(f)

0         arun
1        rashi
2       magizh
3       chitra
4       tharun
5        varun
6          NaN
7       monish
8       thanvi
9       swetha
10        rani
11       kumar
12     santosh
13       maddy
14    thrishal
15        moni
16       priya
17      sherin
18      kaviya
19        viji
Name: NAME, dtype: object

In [ ]:
print("\nReplaceValue:")
k=df.fillna(method='pad')
print(k)
print("\n updated list\n")
k.to_excel("/content/Marks2.xlsx")

ReplaceValue:
    S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      105      arun  87.0  89.0   90.0     94.0    99.0  459.0
1      2      106     rashi  98.0  75.0   90.0     89.0    78.0  430.0
2      3      107    magizh  99.0  98.0   97.0    100.0    90.0  484.0
3      4      108    chitra  80.0  88.0   98.0     96.0    94.0  456.0
4      5      109    tharun  78.0  79.0   90.0     80.0    79.0  406.0
5      6      110     varun  90.0  91.0   92.0     93.0    94.0  460.0
6      7      111     varun  90.0  91.0   92.0     93.0    94.0  460.0
7      8      112    monish  89.0  80.0   87.0     88.0    86.0  430.0
8      9      113    thanvi  78.0  87.0   97.0     90.0    89.0  441.0
9     10      114    swetha  88.0  80.0   89.0     90.0    94.0  441.0
10    11      115      rani  99.0  90.0   83.0     85.0    67.0  424.0
11    12      116     kumar  67.0  60.0   55.0     76.0    57.0  315.0
12    13      117   santosh  99.0  90.0   98.0     97.0    96.0  480.0
13    14      118     maddy  86.0  89.0   90.0     76.0    89.0  430.0
14    15      119  thrishal  99.0  96.0   95.0     86.0    87.0  463.0
15    16      120      moni  90.0  88.0   90.0     89.0    90.0  447.0
16    17      121     priya  99.0  90.0   95.0     85.0    91.0  460.0
17    18      122    sherin  97.0  98.0   94.0     94.0    90.0  473.0
18    19      123    kaviya  95.0  87.0   95.0     96.0    98.0  471.0
19    20      124      viji  94.0  88.0   56.0     99.0    99.0  436.0

 updated list

<ipython-input-7-0341b9640b98>:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  k=df.fillna(method='pad')

In [ ]:
print("\n Drop one particular column and its values:\n")
k.drop(['SOCIAL'],axis=1,inplace=True)
print(k)
print("\n updated list\n")
k.to_excel("/content/Marks2.xlsx")

 Drop one particular column and its values:

    S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  TOTAL
0      1      105      arun  87.0  89.0   90.0     94.0  459.0
1      2      106     rashi  98.0  75.0   90.0     89.0  430.0
2      3      107    magizh  99.0  98.0   97.0    100.0  484.0
3      4      108    chitra  80.0  88.0   98.0     96.0  456.0
4      5      109    tharun  78.0  79.0   90.0     80.0  406.0
5      6      110     varun  90.0  91.0   92.0     93.0  460.0
6      7      111     varun  90.0  91.0   92.0     93.0  460.0
7      8      112    monish  89.0  80.0   87.0     88.0  430.0
8      9      113    thanvi  78.0  87.0   97.0     90.0  441.0
9     10      114    swetha  88.0  80.0   89.0     90.0  441.0
10    11      115      rani  99.0  90.0   83.0     85.0  424.0
11    12      116     kumar  67.0  60.0   55.0     76.0  315.0
12    13      117   santosh  99.0  90.0   98.0     97.0  480.0
13    14      118     maddy  86.0  89.0   90.0     76.0  430.0
14    15      119  thrishal  99.0  96.0   95.0     86.0  463.0
15    16      120      moni  90.0  88.0   90.0     89.0  447.0
16    17      121     priya  99.0  90.0   95.0     85.0  460.0
17    18      122    sherin  97.0  98.0   94.0     94.0  473.0
18    19      123    kaviya  95.0  87.0   95.0     96.0  471.0
19    20      124      viji  94.0  88.0   56.0     99.0  436.0

 updated list

In [ ]:
print("\n Drop NaNrows:\n")
df=pd.read_excel("/content/Marks.xlsx")
print(df)

 Drop NaNrows:

    S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      105      arun  87.0  89.0   90.0     94.0    99.0  459.0
1      2      106     rashi  98.0  75.0   90.0     89.0    78.0  430.0
2      3      107    magizh  99.0  98.0   97.0    100.0    90.0  484.0
3      4      108    chitra  80.0  88.0   98.0     96.0    94.0  456.0
4      5      109    tharun  78.0  79.0   90.0     80.0    79.0  406.0
5      6      110     varun  90.0  91.0   92.0     93.0    94.0  460.0
6      7      111       NaN   NaN   NaN    NaN      NaN     NaN    NaN
7      8      112    monish  89.0  80.0   87.0     88.0    86.0  430.0
8      9      113    thanvi  78.0  87.0   97.0     90.0    89.0  441.0
9     10      114    swetha  88.0  80.0   89.0     90.0    94.0  441.0
10    11      115      rani  99.0  90.0   83.0     85.0    67.0  424.0
11    12      116     kumar  67.0  60.0   55.0     76.0    57.0  315.0
12    13      117   santosh  99.0  90.0   98.0     97.0    96.0  480.0
13    14      118     maddy  86.0  89.0   90.0     76.0    89.0  430.0
14    15      119  thrishal  99.0  96.0   95.0     86.0    87.0  463.0
15    16      120      moni  90.0  88.0   90.0     89.0    90.0  447.0
16    17      121     priya  99.0  90.0   95.0     85.0    91.0  460.0
17    18      122    sherin  97.0  98.0   94.0     94.0    90.0  473.0
18    19      123    kaviya  95.0  87.0   95.0     96.0    98.0  471.0
19    20      124      viji  94.0  88.0   56.0     99.0    99.0  436.0

In [7]:
import pandas as pd
print("\n Replace values:\n")
n=pd.read_excel("/Marks.xlsx")
print("\n original data:\n")
print(n)
y=n.replace({89:88})
print("\n Replaced dataset:\n")
print(y)
print("\n updated dataset:\n")
y.to_excel("/Marks.xlsx")

 Replace values:


 original data:

    S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      105      arun  87.0  89.0   90.0     94.0    99.0  459.0
1      2      106     rashi  98.0  75.0   90.0     89.0    78.0  430.0
2      3      107    magizh  99.0  98.0   97.0    100.0    90.0  484.0
3      4      108    chitra  80.0  88.0   98.0     96.0    94.0  456.0
4      5      109    tharun  78.0  79.0   90.0     80.0    79.0  406.0
5      6      110     varun  90.0  91.0   92.0     93.0    94.0  460.0
6      7      111       NaN   NaN   NaN    NaN      NaN     NaN    NaN
7      8      112    monish  89.0  80.0   87.0     88.0    86.0  430.0
8      9      113    thanvi  78.0  87.0   97.0     90.0    89.0  441.0
9     10      114    swetha  88.0  80.0   89.0     90.0    94.0  441.0
10    11      115      rani  99.0  90.0   83.0     85.0    67.0  424.0
11    12      116     kumar  67.0  60.0   55.0     76.0    57.0  315.0
12    13      117   santosh  99.0  90.0   98.0     97.0    96.0  480.0
13    14      118     maddy  86.0  89.0   90.0     76.0    89.0  430.0
14    15      119  thrishal  99.0  96.0   95.0     86.0    87.0  463.0
15    16      120      moni  90.0  88.0   90.0     89.0    90.0  447.0
16    17      121     priya  99.0  90.0   95.0     85.0    91.0  460.0
17    18      122    sherin  97.0  98.0   94.0     94.0    90.0  473.0
18    19      123    kaviya  95.0  87.0   95.0     96.0    98.0  471.0
19    20      124      viji  94.0  88.0   56.0     99.0    99.0  436.0

 Replaced dataset:

    S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  TOTAL
0      1      105      arun  87.0  88.0   90.0     94.0    99.0  459.0
1      2      106     rashi  98.0  75.0   90.0     88.0    78.0  430.0
2      3      107    magizh  99.0  98.0   97.0    100.0    90.0  484.0
3      4      108    chitra  80.0  88.0   98.0     96.0    94.0  456.0
4      5      109    tharun  78.0  79.0   90.0     80.0    79.0  406.0
5      6      110     varun  90.0  91.0   92.0     93.0    94.0  460.0
6      7      111       NaN   NaN   NaN    NaN      NaN     NaN    NaN
7      8      112    monish  88.0  80.0   87.0     88.0    86.0  430.0
8      9      113    thanvi  78.0  87.0   97.0     90.0    88.0  441.0
9     10      114    swetha  88.0  80.0   88.0     90.0    94.0  441.0
10    11      115      rani  99.0  90.0   83.0     85.0    67.0  424.0
11    12      116     kumar  67.0  60.0   55.0     76.0    57.0  315.0
12    13      117   santosh  99.0  90.0   98.0     97.0    96.0  480.0
13    14      118     maddy  86.0  88.0   90.0     76.0    88.0  430.0
14    15      119  thrishal  99.0  96.0   95.0     86.0    87.0  463.0
15    16      120      moni  90.0  88.0   90.0     88.0    90.0  447.0
16    17      121     priya  99.0  90.0   95.0     85.0    91.0  460.0
17    18      122    sherin  97.0  98.0   94.0     94.0    90.0  473.0
18    19      123    kaviya  95.0  87.0   95.0     96.0    98.0  471.0
19    20      124      viji  94.0  88.0   56.0     99.0    99.0  436.0

 updated dataset:

In [9]:
df=pd.read_excel("/Marks.xlsx")
print(df)
print("\n Extract using isin()function:\n")
new=df["SCIENCE"].isin([93])
print(df[new])

    Unnamed: 0  S.NO  ROLL NO      NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  \
0            0     1      105      arun  87.0  88.0   90.0     94.0    99.0
1            1     2      106     rashi  98.0  75.0   90.0     88.0    78.0
2            2     3      107    magizh  99.0  98.0   97.0    100.0    90.0
3            3     4      108    chitra  80.0  88.0   98.0     96.0    94.0
4            4     5      109    tharun  78.0  79.0   90.0     80.0    79.0
5            5     6      110     varun  90.0  91.0   92.0     93.0    94.0
6            6     7      111       NaN   NaN   NaN    NaN      NaN     NaN
7            7     8      112    monish  88.0  80.0   87.0     88.0    86.0
8            8     9      113    thanvi  78.0  87.0   97.0     90.0    88.0
9            9    10      114    swetha  88.0  80.0   88.0     90.0    94.0
10          10    11      115      rani  99.0  90.0   83.0     85.0    67.0
11          11    12      116     kumar  67.0  60.0   55.0     76.0    57.0
12          12    13      117   santosh  99.0  90.0   98.0     97.0    96.0
13          13    14      118     maddy  86.0  88.0   90.0     76.0    88.0
14          14    15      119  thrishal  99.0  96.0   95.0     86.0    87.0
15          15    16      120      moni  90.0  88.0   90.0     88.0    90.0
16          16    17      121     priya  99.0  90.0   95.0     85.0    91.0
17          17    18      122    sherin  97.0  98.0   94.0     94.0    90.0
18          18    19      123    kaviya  95.0  87.0   95.0     96.0    98.0
19          19    20      124      viji  94.0  88.0   56.0     99.0    99.0

    TOTAL
0   459.0
1   430.0
2   484.0
3   456.0
4   406.0
5   460.0
6     NaN
7   430.0
8   441.0
9   441.0
10  424.0
11  315.0
12  480.0
13  430.0
14  463.0
15  447.0
16  460.0
17  473.0
18  471.0
19  436.0

 Extract using isin()function:

   Unnamed: 0  S.NO  ROLL NO   NAME   ENG   TAM  MATHS  SCIENCE  SOCIAL  TOTAL
5           5     6      110  varun  90.0  91.0   92.0     93.0    94.0  460.0

# New section